cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xT_svd.xml
        <!-- REGISTER "EPFR06" -->
        <register>
          <name>EPFR06</name>
          <description> register EPFR06 </description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT15S" -->
            <field>
              <name>EINT15S</name>
              <description> bitfield EINT15S </description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT14S" -->
            <field>
              <name>EINT14S</name>
              <description> bitfield EINT14S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT13S" -->
            <field>
              <name>EINT13S</name>
              <description> bitfield EINT13S </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT12S" -->
            <field>
              <name>EINT12S</name>
              <description> bitfield EINT12S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT11S" -->
            <field>
              <name>EINT11S</name>
              <description> bitfield EINT11S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT10S" -->
            <field>
              <name>EINT10S</name>
              <description> bitfield EINT10S </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT09S" -->
            <field>
              <name>EINT09S</name>
              <description> bitfield EINT09S </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT08S" -->
            <field>
              <name>EINT08S</name>
              <description> bitfield EINT08S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT07S" -->
            <field>
              <name>EINT07S</name>
              <description> bitfield EINT07S </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT06S" -->
            <field>
              <name>EINT06S</name>
              <description> bitfield EINT06S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT05S" -->
            <field>
              <name>EINT05S</name>
              <description> bitfield EINT05S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT04S" -->
            <field>
              <name>EINT04S</name>
              <description> bitfield EINT04S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT03S" -->
            <field>
              <name>EINT03S</name>
              <description> bitfield EINT03S </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT02S" -->
            <field>
              <name>EINT02S</name>
              <description> bitfield EINT02S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT01S" -->
            <field>
              <name>EINT01S</name>
              <description> bitfield EINT01S </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT00S" -->
            <field>
              <name>EINT00S</name>
              <description> bitfield EINT00S </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR07" -->
        <register>
          <name>EPFR07</name>
          <description> register EPFR07 </description>
          <addressOffset>0x61C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK3B" -->
            <field>
              <name>SCK3B</name>
              <description> bitfield SCK3B </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT3B" -->
            <field>
              <name>SOT3B</name>
              <description> bitfield SOT3B </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN3S" -->
            <field>
              <name>SIN3S</name>
              <description> bitfield SIN3S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK2B" -->
            <field>
              <name>SCK2B</name>
              <description> bitfield SCK2B </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT2B" -->
            <field>
              <name>SOT2B</name>
              <description> bitfield SOT2B </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN2S" -->
            <field>
              <name>SIN2S</name>
              <description> bitfield SIN2S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK1B" -->
            <field>
              <name>SCK1B</name>
              <description> bitfield SCK1B </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT1B" -->
            <field>
              <name>SOT1B</name>
              <description> bitfield SOT1B </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN1S" -->
            <field>
              <name>SIN1S</name>
              <description> bitfield SIN1S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK0B" -->
            <field>
              <name>SCK0B</name>
              <description> bitfield SCK0B </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT0B" -->
            <field>
              <name>SOT0B</name>
              <description> bitfield SOT0B </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN0S" -->
            <field>
              <name>SIN0S</name>
              <description> bitfield SIN0S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
