cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xT_svd.xml
        <!-- REGISTER "EPFR11" -->
        <register>
          <name>EPFR11</name>
          <description> register EPFR11 </description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UERLC" -->
            <field>
              <name>UERLC</name>
              <description> bitfield UERLC </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED15B" -->
            <field>
              <name>UED15B</name>
              <description> bitfield UED15B </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED14B" -->
            <field>
              <name>UED14B</name>
              <description> bitfield UED14B </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED13B" -->
            <field>
              <name>UED13B</name>
              <description> bitfield UED13B </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED12B" -->
            <field>
              <name>UED12B</name>
              <description> bitfield UED12B </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED11B" -->
            <field>
              <name>UED11B</name>
              <description> bitfield UED11B </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED10B" -->
            <field>
              <name>UED10B</name>
              <description> bitfield UED10B </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED09B" -->
            <field>
              <name>UED09B</name>
              <description> bitfield UED09B </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED08B" -->
            <field>
              <name>UED08B</name>
              <description> bitfield UED08B </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED07B" -->
            <field>
              <name>UED07B</name>
              <description> bitfield UED07B </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED06B" -->
            <field>
              <name>UED06B</name>
              <description> bitfield UED06B </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED05B" -->
            <field>
              <name>UED05B</name>
              <description> bitfield UED05B </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED04B" -->
            <field>
              <name>UED04B</name>
              <description> bitfield UED04B </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED03B" -->
            <field>
              <name>UED03B</name>
              <description> bitfield UED03B </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED02B" -->
            <field>
              <name>UED02B</name>
              <description> bitfield UED02B </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED01B" -->
            <field>
              <name>UED01B</name>
              <description> bitfield UED01B </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED00B" -->
            <field>
              <name>UED00B</name>
              <description> bitfield UED00B </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA07E" -->
            <field>
              <name>UEA07E</name>
              <description> bitfield UEA07E </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA06E" -->
            <field>
              <name>UEA06E</name>
              <description> bitfield UEA06E </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA05E" -->
            <field>
              <name>UEA05E</name>
              <description> bitfield UEA05E </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA04E" -->
            <field>
              <name>UEA04E</name>
              <description> bitfield UEA04E </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA03E" -->
            <field>
              <name>UEA03E</name>
              <description> bitfield UEA03E </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA02E" -->
            <field>
              <name>UEA02E</name>
              <description> bitfield UEA02E </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA01E" -->
            <field>
              <name>UEA01E</name>
              <description> bitfield UEA01E </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS0E" -->
            <field>
              <name>UECS0E</name>
              <description> bitfield UECS0E </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEALEE" -->
            <field>
              <name>UEALEE</name>
              <description> bitfield UEALEE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR12" -->
        <register>
          <name>EPFR12</name>
          <description> register EPFR12 </description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB11S" -->
            <field>
              <name>TIOB11S</name>
              <description> bitfield TIOB11S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA11E" -->
            <field>
              <name>TIOA11E</name>
              <description> bitfield TIOA11E </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA11S" -->
            <field>
              <name>TIOA11S</name>
              <description> bitfield TIOA11S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB10S" -->
            <field>
              <name>TIOB10S</name>
              <description> bitfield TIOB10S </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA10E" -->
            <field>
              <name>TIOA10E</name>
              <description> bitfield TIOA10E </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB9S" -->
            <field>
              <name>TIOB9S</name>
              <description> bitfield TIOB9S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA9E" -->
            <field>
              <name>TIOA9E</name>
              <description> bitfield TIOA9E </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA9S" -->
            <field>
              <name>TIOA9S</name>
              <description> bitfield TIOA9S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB8S" -->
            <field>
              <name>TIOB8S</name>
              <description> bitfield TIOB8S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA8E" -->
            <field>
              <name>TIOA8E</name>
              <description> bitfield TIOA8E </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR13" -->
        <register>
          <name>EPFR13</name>
          <description> register EPFR13 </description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB15S" -->
            <field>
              <name>TIOB15S</name>
              <description> bitfield TIOB15S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA15E" -->
            <field>
              <name>TIOA15E</name>
              <description> bitfield TIOA15E </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA15S" -->
            <field>
              <name>TIOA15S</name>
              <description> bitfield TIOA15S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB14S" -->
            <field>
              <name>TIOB14S</name>
              <description> bitfield TIOB14S </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA14E" -->
            <field>
              <name>TIOA14E</name>
              <description> bitfield TIOA14E </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB13S" -->
            <field>
              <name>TIOB13S</name>
              <description> bitfield TIOB13S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA13E" -->
            <field>
              <name>TIOA13E</name>
              <description> bitfield TIOA13E </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA13S" -->
            <field>
              <name>TIOA13S</name>
              <description> bitfield TIOA13S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB12S" -->
            <field>
              <name>TIOB12S</name>
              <description> bitfield TIOB12S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA12E" -->
            <field>
              <name>TIOA12E</name>
              <description> bitfield TIOA12E </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR14" -->
        <register>
          <name>EPFR14</name>
          <description> register EPFR14 </description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description> register EPFR15 </description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT31S" -->
            <field>
              <name>EINT31S</name>
              <description> bitfield EINT31S </description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT30S" -->
            <field>
              <name>EINT30S</name>
              <description> bitfield EINT30S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT29S" -->
            <field>
              <name>EINT29S</name>
              <description> bitfield EINT29S </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT28S" -->
            <field>
              <name>EINT28S</name>
              <description> bitfield EINT28S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT27S" -->
            <field>
              <name>EINT27S</name>
              <description> bitfield EINT27S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT26S" -->
            <field>
              <name>EINT26S</name>
              <description> bitfield EINT26S </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT25S" -->
            <field>
              <name>EINT25S</name>
              <description> bitfield EINT25S </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT24S" -->
            <field>
              <name>EINT24S</name>
              <description> bitfield EINT24S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT23S" -->
            <field>
              <name>EINT23S</name>
              <description> bitfield EINT23S </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT22S" -->
            <field>
              <name>EINT22S</name>
              <description> bitfield EINT22S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT21S" -->
            <field>
              <name>EINT21S</name>
              <description> bitfield EINT21S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT20S" -->
            <field>
              <name>EINT20S</name>
              <description> bitfield EINT20S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT19S" -->
            <field>
              <name>EINT19S</name>
              <description> bitfield EINT19S </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT18S" -->
            <field>
              <name>EINT18S</name>
              <description> bitfield EINT18S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT17S" -->
            <field>
              <name>EINT17S</name>
              <description> bitfield EINT17S </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT16S" -->
            <field>
              <name>EINT16S</name>
              <description> bitfield EINT16S </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
