cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xT_svd.xml
    <!-- PERIPHERAL "MFS9" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS9</name>
      <baseAddress>0x40038900</baseAddress>
      <!-- INTERRUPT "MFS1_9_RX" -->
      <interrupt>
        <name>MFS1_9_RX</name>
        <value>9</value>
      </interrupt>
      <!-- INTERRUPT "MFS1_9_TX" -->
      <interrupt>
        <name>MFS1_9_TX</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS10" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS10</name>
      <baseAddress>0x40038A00</baseAddress>
      <!-- INTERRUPT "MFS2_10_RX" -->
      <interrupt>
        <name>MFS2_10_RX</name>
        <value>11</value>
      </interrupt>
      <!-- INTERRUPT "MFS2_10_TX" -->
      <interrupt>
        <name>MFS2_10_TX</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS11" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS11</name>
      <baseAddress>0x40038B00</baseAddress>
      <!-- INTERRUPT "MFS3_11_RX" -->
      <interrupt>
        <name>MFS3_11_RX</name>
        <value>13</value>
      </interrupt>
      <!-- INTERRUPT "MFS3_11_TX" -->
      <interrupt>
        <name>MFS3_11_TX</name>
        <value>14</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS12" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS12</name>
      <baseAddress>0x40038C00</baseAddress>
      <!-- INTERRUPT "MFS4_12_RX" -->
      <interrupt>
        <name>MFS4_12_RX</name>
        <value>15</value>
      </interrupt>
      <!-- INTERRUPT "MFS4_12_TX" -->
      <interrupt>
        <name>MFS4_12_TX</name>
        <value>16</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS13" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS13</name>
      <baseAddress>0x40038D00</baseAddress>
      <!-- INTERRUPT "MFS5_13_RX" -->
      <interrupt>
        <name>MFS5_13_RX</name>
        <value>17</value>
      </interrupt>
      <!-- INTERRUPT "MFS5_13_TX" -->
      <interrupt>
        <name>MFS5_13_TX</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS14" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS14</name>
      <baseAddress>0x40038E00</baseAddress>
      <!-- INTERRUPT "MFS6_14_RX" -->
      <interrupt>
        <name>MFS6_14_RX</name>
        <value>19</value>
      </interrupt>
      <!-- INTERRUPT "MFS6_14_TX" -->
      <interrupt>
        <name>MFS6_14_TX</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS15" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS15</name>
      <baseAddress>0x40038F00</baseAddress>
      <!-- INTERRUPT "MFS7_15_RX" -->
      <interrupt>
        <name>MFS7_15_RX</name>
        <value>21</value>
      </interrupt>
      <!-- INTERRUPT "MFS7_15_TX" -->
      <interrupt>
        <name>MFS7_15_TX</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "RTC" -->
    <peripheral>
      <name>RTC</name>
      <description> peripheral RTC </description>
      <groupName>RTC</groupName>
      <baseAddress>0x4003B000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x13</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x19</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WTCR1" -->
        <register>
          <name>WTCR1</name>
          <description> register WTCR1 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1F7D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTCRIE" -->
            <field>
              <name>INTCRIE</name>
              <description> bitfield INTCRIE </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERIE" -->
            <field>
              <name>INTERIE</name>
              <description> bitfield INTERIE </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALIE" -->
            <field>
              <name>INTALIE</name>
              <description> bitfield INTALIE </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMIE" -->
            <field>
              <name>INTTMIE</name>
              <description> bitfield INTTMIE </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHIE" -->
            <field>
              <name>INTHIE</name>
              <description> bitfield INTHIE </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMIE" -->
            <field>
              <name>INTMIE</name>
              <description> bitfield INTMIE </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSIE" -->
            <field>
              <name>INTSIE</name>
              <description> bitfield INTSIE </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSIE" -->
            <field>
              <name>INTSSIE</name>
              <description> bitfield INTSSIE </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTCRI" -->
            <field>
              <name>INTCRI</name>
              <description> bitfield INTCRI </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERI" -->
            <field>
              <name>INTERI</name>
              <description> bitfield INTERI </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALI" -->
            <field>
              <name>INTALI</name>
              <description> bitfield INTALI </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMI" -->
            <field>
              <name>INTTMI</name>
              <description> bitfield INTTMI </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHI" -->
            <field>
              <name>INTHI</name>
              <description> bitfield INTHI </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMI" -->
            <field>
              <name>INTMI</name>
              <description> bitfield INTMI </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSI" -->
            <field>
              <name>INTSI</name>
              <description> bitfield INTSI </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSI" -->
            <field>
              <name>INTSSI</name>
              <description> bitfield INTSSI </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "YEN" -->
            <field>
              <name>YEN</name>
              <description> bitfield YEN </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOEN" -->
            <field>
              <name>MOEN</name>
              <description> bitfield MOEN </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEN" -->
            <field>
              <name>DEN</name>
              <description> bitfield DEN </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HEN" -->
            <field>
              <name>HEN</name>
              <description> bitfield HEN </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MIEN" -->
            <field>
              <name>MIEN</name>
              <description> bitfield MIEN </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description> bitfield BUSY </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCRST" -->
            <field>
              <name>SCRST</name>
              <description> bitfield SCRST </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCST" -->
            <field>
              <name>SCST</name>
              <description> bitfield SCST </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description> bitfield SRST </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RUN" -->
            <field>
              <name>RUN</name>
              <description> bitfield RUN </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description> bitfield ST </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCR2" -->
        <register>
          <name>WTCR2</name>
          <description> register WTCR2 </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000701</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMRUN" -->
            <field>
              <name>TMRUN</name>
              <description> bitfield TMRUN </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMEN" -->
            <field>
              <name>TMEN</name>
              <description> bitfield TMEN </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMST" -->
            <field>
              <name>TMST</name>
              <description> bitfield TMST </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CREAD" -->
            <field>
              <name>CREAD</name>
              <description> bitfield CREAD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
