cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xT_svd.xml
        <!-- REGISTER "DMACDA1" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA1</name>
          <description> register DMACDA1 </description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "DMACA2" -->
        <register derivedFrom="DMACA0">
          <name>DMACA2</name>
          <description> register DMACA2 </description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "DMACB2" -->
        <register derivedFrom="DMACB0">
          <name>DMACB2</name>
          <description> register DMACB2 </description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "DMACSA2" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA2</name>
          <description> register DMACSA2 </description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "DMACDA2" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA2</name>
          <description> register DMACDA2 </description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "DMACA3" -->
        <register derivedFrom="DMACA0">
          <name>DMACA3</name>
          <description> register DMACA3 </description>
          <addressOffset>0x40</addressOffset>
        </register>
        <!-- REGISTER "DMACB3" -->
        <register derivedFrom="DMACB0">
          <name>DMACB3</name>
          <description> register DMACB3 </description>
          <addressOffset>0x44</addressOffset>
        </register>
        <!-- REGISTER "DMACSA3" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA3</name>
          <description> register DMACSA3 </description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "DMACDA3" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA3</name>
          <description> register DMACDA3 </description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <!-- REGISTER "DMACA4" -->
        <register derivedFrom="DMACA0">
          <name>DMACA4</name>
          <description> register DMACA4 </description>
          <addressOffset>0x50</addressOffset>
        </register>
        <!-- REGISTER "DMACB4" -->
        <register derivedFrom="DMACB0">
          <name>DMACB4</name>
          <description> register DMACB4 </description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "DMACSA4" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA4</name>
          <description> register DMACSA4 </description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "DMACDA4" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA4</name>
          <description> register DMACDA4 </description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "DMACA5" -->
        <register derivedFrom="DMACA0">
          <name>DMACA5</name>
          <description> register DMACA5 </description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "DMACB5" -->
        <register derivedFrom="DMACB0">
          <name>DMACB5</name>
          <description> register DMACB5 </description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "DMACSA5" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA5</name>
          <description> register DMACSA5 </description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "DMACDA5" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA5</name>
          <description> register DMACDA5 </description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "DMACA6" -->
        <register derivedFrom="DMACA0">
          <name>DMACA6</name>
          <description> register DMACA6 </description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "DMACB6" -->
        <register derivedFrom="DMACB0">
          <name>DMACB6</name>
          <description> register DMACB6 </description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "DMACSA6" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA6</name>
          <description> register DMACSA6 </description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "DMACDA6" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA6</name>
          <description> register DMACDA6 </description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DMACA7" -->
        <register derivedFrom="DMACA0">
          <name>DMACA7</name>
          <description> register DMACA7 </description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "DMACB7" -->
        <register derivedFrom="DMACB0">
          <name>DMACB7</name>
          <description> register DMACB7 </description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "DMACSA7" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA7</name>
          <description> register DMACSA7 </description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "DMACDA7" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA7</name>
          <description> register DMACDA7 </description>
          <addressOffset>0x8C</addressOffset>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>